#+TITLE: Python Tutorial Info
#+AUTHOR: Prof. T. R. Mahore

**** Install Python
- Given command will install the specific python version. You can check the version needed by using the previous command. The command will take lil bit time to install the specified python version.

  #+begin_src bash :results output
  pyenv install 3.9.0
  #+end_src

- After the installation you can check the available versions of python by typing the following command in terminal. It will generate the output of the installed version, and the * means that the current version we are using.

  #+begin_src bash :results output
  pyenv versions
  #+end_src

  #+RESULTS:
  : * system (set by /Users/tusharmahore/.pyenv/version)
  :   3.9.0

- To set the global version, or what we can say to change the version of python, following command is used. After you can check the version of python of your system.

  #+begin_src bash :results output
  pyenv global 3.9.0
  #+end_src

  To revert it back to the system version you can use ~pyenv global system~.

- Before that you should run ~pyenv rehash~ command, to make sure that every command works fine. This command updates pyenv, so after running this it will know that we have installed new version of python.

